player = {
    "name": "",
    "armor": 0.95,
    "hp": 160,
    "attack": 35,
    "luck": 15, 
    "money": 10000,
    "inventory": []
}

enemies = [
    {
     "name": "exe.Vinipuh",
     "hp": 74,
     "attack": 23,
     "script": "зачем ты здесь? ты не сможешь меня победить. ты слишком слаб." ,
     "win": "ты хороший противник. я тебе ещё покажу.",
     "lose": "Ха! я знал что я выиграю. СЛААААБЫЙ!"
    },

    {
     "name": "exe.Sonic",
     "hp": 89,
     "attack": 25,
     "script": "зачем ты здесь? я слишком быстр для твоих глаз. ты не поймешь как будешь уже повержен. ХА-ХА-ХА!!!" ,
     "win": "ты был хорош. Но я требую реванш!",
     "lose": "это было ОЖИДАЕМО! ты проиграл в честном бою."
    },

    {
     "name": "exe.Cheburashka",
     "hp": 104,
     "attack": 27,
     "script": "зачем ты здесь? я закидаю тебя апельсинами. ТЫ будешь унижен!!" ,
     "win": "ФУХ! АШ жизнь перед глазами пролетела.",
     "lose": "теперь все знают кто мастер боевых искусств"
    },

    {
     "name": "exe.Crocodil_Gena",
     "hp": 119,
     "attack": 29,
     "script": "зачем ты здесь? ты что не заметил какие у меня зубы? я тебя съем и не подавлюсь!! после этого боя ты переоценишь свои силы. " ,
     "win": "В следующий раз ты будешь валяться у меня в ногах!! я ещё вернусь. ",
     "lose": "в следующий раз тебе будет ещё хуже. я просто был уверен в себе. "
    },

    {
     "name": "exe.Kolobok",
     "hp": 134,
     "attack": 31,
     "script": "зачем ты здесь? скажу тебе просто, ты делаешь сам себе хуже..." ,
     "win": "ты ещё отведаешь силушки богатырской. сильно не расслабляйся",
     "lose": "Ха! в следующий раз думай наперед. ЛОПУХ!!!"
    },

    {
     "name": "exe.Koshey",
     "hp": 149,
     "attack": 33,
     "script": "зачем ты здесь? не думаю что ты сегодня будешь рад уйти с разбитым лицом..." ,
     "win": "ЛАААААААКИ!!! тебе просто повезло. сегодня не мой день.",
     "lose": "Ха! советую тебе больше никогда не кидать мне вызовы."
    },

    {
     "name": "exe.Mishka_Narushka",
     "hp": 164,
     "attack": 35,
     "script": "зачем ты здесь? это будет один из самых твоих худших дней.",
     "win": "я просто поддавалась тебе так что ты не радуйся. ОК? ",
     "lose": "Ха! хвостиком махнула и дело сделано. ты такой легкий..."
    },
]

items = {
    "1" : {"name":"Зелье удачи", "price":1500},
    "2" : {"name":"Пропуск тренировки", "price":1000},
}